# AssemblyMemberDifferentParameters Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentParameters Properties
AssemblyMemberDifferentParameters Class See Also
---
The AssemblyMemberDifferentParameters type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssemblyMemberDifference.) |

# See Also
AssemblyMemberDifferentParameters Class
Autodesk.Revit.DB Namespace